[Killed] PublicVisibility
Context/Entity/Offer.php:30:5
     /**
      * @return array<int, string>
      */
-    public function getAdditionalNames(): array
+    protected function getAdditionalNames(): array
     {
         return array_keys($this->additionals);
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.f5375f9cd86f8d400af1c5ee1cc13923.infection.xml

E

Time: 00:00.003, Memory: 18.00 MB

[Killed] PublicVisibility
Context/Entity/Offer.php:35:5
         return array_keys($this->additionals);
     }
 
-    public function addAdditional(Additional $additional): self
+    protected function addAdditional(Additional $additional): self
     {
         $this->additionals[$additional->name] = $additional;
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.bf4078db0c4d42223fd7648355de37cf.infection.xml

There was 1 PHPUnit error:

1) Tests\Unit\Context\Factory\OfferFactoryTest::testCreate

[Killed] PublicVisibility
Context/Entity/Offer.php:42:5
         return $this;
     }
 
-    public function getTotalPrice(): Price
+    protected function getTotalPrice(): Price
     {
         $reducer = fn (Price $carry, Additional $item): Price => $carry->add($item->price);
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.a551a1df6073ad7f25dae3251a962277.infection.xml

.....E

Time: 00:00.004, Memory: 18.00 MB
