[Killed] PublicVisibility
Context/Enum/AdditionalType.php:17:5
     case Travel = 100;
     case Unknown = 0;
 
-    public static function fromName(string $name): self
+    protected static function fromName(string $name): self
     {
         return self::tryFromName($name) ?? self::Unknown;
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.bb819e8daa2fc29e51933059e7d9387c.infection.xml

.E

Time: 00:00.003, Memory: 18.00 MB

[Killed] Coalesce
Context/Enum/AdditionalType.php:19:9
 
     public static function fromName(string $name): self
     {
-        return self::tryFromName($name) ?? self::Unknown;
+        return self::Unknown ?? self::tryFromName($name);
     }
 }
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.f19779f00f94c910ac264298cb319de5.infection.xml

.F

Time: 00:00.003, Memory: 18.00 MB
