[Killed] PublicVisibility
Context/Factory/OfferFactory.php:13:5
 
 class OfferFactory
 {
-    public function create(string $insuranceType, string ...$additionals): Offer
+    protected function create(string $insuranceType, string ...$additionals): Offer
     {
         $insurance = new Insurance(InsuranceType::fromName($insuranceType));
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.cab4d2e3a7dd3dc69ba33dd7b5ad38a3.infection.xml

E

Time: 00:00.002, Memory: 18.00 MB

[Killed] Foreach_
Context/Factory/OfferFactory.php:19:9
 
         $offer = new Offer(Id::generate(), $insurance);
 
-        foreach ($additionals as $additional) {
-            $type = AdditionalType::fromName($additional);
-            $offer->addAdditional(new Additional($type));
-        }
+        foreach ([] as $additional) {
 
         return $offer;
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.a1c1e4db7edd105f5f008901940e0ce5.infection.xml

.F

Time: 00:00.003, Memory: 18.00 MB

[Killed] MethodCallRemoval
Context/Factory/OfferFactory.php:21:13
 
         foreach ($additionals as $additional) {
             $type = AdditionalType::fromName($additional);
-            $offer->addAdditional(new Additional($type));
+            
         }
 
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.c7fcb1e379487e83432033d75275c636.infection.xml

.F

Time: 00:00.003, Memory: 18.00 MB
