[Killed] PublicVisibility
Context/Service/Calculator.php:20:5
     /**
      * @param array<int, string> $additionals
      */
-    public function calculate(string $insuranceType, array $additionals): int
+    protected function calculate(string $insuranceType, array $additionals): int
     {
         $offer = $this->offerFactory->create($insuranceType, ...$additionals);
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.709b233121618225de73b99f5ce496e1.infection.xml

E

Time: 00:00.003, Memory: 18.00 MB
