[Killed] PublicVisibility
Context/Trait/CanTryFromName.php:9:5
 
 trait CanTryFromName
 {
-    public static function tryFromName(string $name): self|null
+    protected static function tryFromName(string $name): self|null
     {
         $searchName = strtoupper($name);
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.df524928eda36d4a60d6025220cb5aa8.infection.xml

............E

Time: 00:00.005, Memory: 18.00 MB

[Killed] UnwrapStrToUpper
Context/Trait/CanTryFromName.php:11:9
 {
     public static function tryFromName(string $name): self|null
     {
-        $searchName = strtoupper($name);
+        $searchName = $name;
 
         foreach (self::cases() as $case) {
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.70619f8326aa34f057fce92b91da6c20.infection.xml

F

Time: 00:00.003, Memory: 18.00 MB

[Killed] Foreach_
Context/Trait/CanTryFromName.php:13:9
     {
         $searchName = strtoupper($name);
 
-        foreach (self::cases() as $case) {
-            if (strtoupper($case->name) === $searchName) {
-                return $case;
-            }
-        }
+        foreach ([] as $case) {
 
         return null;
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.3f153fc42577440d46ed694db6c32c3d.infection.xml

F

Time: 00:00.003, Memory: 18.00 MB

[Killed] UnwrapStrToUpper
Context/Trait/CanTryFromName.php:14:13
         $searchName = strtoupper($name);
 
         foreach (self::cases() as $case) {
-            if (strtoupper($case->name) === $searchName) {
+            if ($case->name === $searchName) {
                 return $case;
             }
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.5cae310ff39825dc550a48a9b7a8408a.infection.xml

F

Time: 00:00.002, Memory: 18.00 MB

[Killed] Identical
Context/Trait/CanTryFromName.php:14:13
         $searchName = strtoupper($name);
 
         foreach (self::cases() as $case) {
-            if (strtoupper($case->name) === $searchName) {
+            if (strtoupper($case->name) !== $searchName) {
                 return $case;
             }
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.56af291603b16802ef49c92b8343555d.infection.xml

F

Time: 00:00.002, Memory: 18.00 MB

[Killed] ReturnRemoval
Context/Trait/CanTryFromName.php:15:17
 
         foreach (self::cases() as $case) {
             if (strtoupper($case->name) === $searchName) {
-                return $case;
+                
             }
         }
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.7a181c21d7962db3ad2b1b4699244e60.infection.xml

F

Time: 00:00.003, Memory: 18.00 MB
