[Killed] UnwrapStrToLower
Context/ValueObject/Additional.php:16:9
 
     public function __construct(AdditionalType $type)
     {
-        $this->name = strtolower($type->name);
+        $this->name = $type->name;
         $this->price = new Price($type->value);
     }
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.6790caa669ef368f65c912d2f4f885f0.infection.xml

F

Time: 00:00.003, Memory: 18.00 MB
