[Killed] PublicVisibility
Context/ValueObject/Id.php:9:5
 
 class Id
 {
-    public static function generate(): self
+    protected static function generate(): self
     {
         return new self(bin2hex(random_bytes(16)));
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.805335d9128bdf137a2ca230b3ae4f93.infection.xml

There were 3 PHPUnit errors:

1) Tests\Unit\Context\Factory\OfferFactoryTest::testCreate

[Killed] IncrementInteger
Context/ValueObject/Id.php:11:9
 {
     public static function generate(): self
     {
-        return new self(bin2hex(random_bytes(16)));
+        return new self(bin2hex(random_bytes(17)));
     }
 
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.22e1d1029b37a5087f4b9f7e562617ea.infection.xml

F

Time: 00:00.003, Memory: 18.00 MB

[Killed] DecrementInteger
Context/ValueObject/Id.php:11:9
 {
     public static function generate(): self
     {
-        return new self(bin2hex(random_bytes(16)));
+        return new self(bin2hex(random_bytes(15)));
     }
 
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.ed558bcd4a172e94bb33b918b4de9153.infection.xml

F

Time: 00:00.003, Memory: 18.00 MB
