[Killed] UnwrapStrToLower
Context/ValueObject/Insurance.php:16:9
 
     public function __construct(InsuranceType $type)
     {
-        $this->type = strtolower($type->name);
+        $this->type = $type->name;
         $this->price = new Price($type->value);
     }
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.afb9fa81caeacabb013e6759f7ab2fab.infection.xml

...............F

Time: 00:00.006, Memory: 18.00 MB
