[Killed] PublicVisibility
Context/ValueObject/Price.php:13:5
     {
     }
 
-    public function add(self $toAdd): self
+    protected function add(self $toAdd): self
     {
         return new self($this->ammount + $toAdd->ammount);
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.e68dc30ea4b3c1adc4c01c282629eaaa.infection.xml

......E

Time: 00:00.005, Memory: 18.00 MB

[Killed] Plus
Context/ValueObject/Price.php:15:9
 
     public function add(self $toAdd): self
     {
-        return new self($this->ammount + $toAdd->ammount);
+        return new self($this->ammount - $toAdd->ammount);
     }
 }
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.cf3236336f4a20c3ac1d7c6575775eb3.infection.xml

......F

Time: 00:00.005, Memory: 18.00 MB
