[Killed] PublicVisibility
InsuranceCalculator.php:25:5
     ) {
     }
 
-    public function calculate(): int
+    protected function calculate(): int
     {
         $basePrice = $this->client->getOffer($this->insuranceType);
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.3082bd6fc40f2b9b07c4745f095ed6f9.infection.xml

E

Time: 00:00.003, Memory: 18.00 MB

[Killed] Foreach_
InsuranceCalculator.php:29:9
     {
         $basePrice = $this->client->getOffer($this->insuranceType);
 
-        foreach ($this->additionals as $additional) {
-            $basePrice += self::ADDITIONAL_PRICES[$additional] ?? 0;
-        }
+        foreach ([] as $additional) {
 
         return $basePrice;
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.df785acb908948c7ef8a69bc1cca0888.infection.xml

F

Time: 00:00.003, Memory: 18.00 MB

[Killed] DecrementInteger
InsuranceCalculator.php:30:13
         $basePrice = $this->client->getOffer($this->insuranceType);
 
         foreach ($this->additionals as $additional) {
-            $basePrice += self::ADDITIONAL_PRICES[$additional] ?? 0;
+            $basePrice += self::ADDITIONAL_PRICES[$additional] ?? -1;
         }
 
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.6df58f370f1e7beda0e714c40576a8f8.infection.xml

..F                                                                 3 / 3 (100%)

Time: 00:00.003, Memory: 18.00 MB

[Killed] PlusEqual
InsuranceCalculator.php:30:13
         $basePrice = $this->client->getOffer($this->insuranceType);
 
         foreach ($this->additionals as $additional) {
-            $basePrice += self::ADDITIONAL_PRICES[$additional] ?? 0;
+            $basePrice -= self::ADDITIONAL_PRICES[$additional] ?? 0;
         }
 
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.dd32b602865592f080c570b92ddb466f.infection.xml

F

Time: 00:00.004, Memory: 18.00 MB
