[Killed] PublicVisibility
OfferClient.php:7:5
 
 class OfferClient
 {
-    public function getOffer(string $insuranceType): int
+    protected function getOffer(string $insuranceType): int
     {
         // Dummy response
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.d10c061507c51b957de92f7beb503da1.infection.xml

E

Time: 00:00.002, Memory: 18.00 MB

[Killed] MatchArmRemoval
OfferClient.php:10:9
     public function getOffer(string $insuranceType): int
     {
         // Dummy response
-        return match ($insuranceType) {
-            InsuranceCalculator::TYPE_FLAT => 100,
-            InsuranceCalculator::TYPE_CASCO => 200,
-            default => 0,
-        };
+        
     }
 }
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.4cab3e4c4d2c29152093e7a847bbf525.infection.xml

F

Time: 00:00.004, Memory: 18.00 MB

[Killed] IncrementInteger
OfferClient.php:11:13
     {
         // Dummy response
         return match ($insuranceType) {
-            InsuranceCalculator::TYPE_FLAT => 100,
+            InsuranceCalculator::TYPE_FLAT => 101,
             InsuranceCalculator::TYPE_CASCO => 200,
             default => 0,
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.efc3e9348512be55574146303a6eea92.infection.xml

F

Time: 00:00.004, Memory: 18.00 MB

[Killed] DecrementInteger
OfferClient.php:11:13
     {
         // Dummy response
         return match ($insuranceType) {
-            InsuranceCalculator::TYPE_FLAT => 100,
+            InsuranceCalculator::TYPE_FLAT => 99,
             InsuranceCalculator::TYPE_CASCO => 200,
             default => 0,
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.dedb8bfcf79e73a8a9d1f979bc121872.infection.xml

F

Time: 00:00.003, Memory: 18.00 MB

[Killed] DecrementInteger
OfferClient.php:12:13
         // Dummy response
         return match ($insuranceType) {
             InsuranceCalculator::TYPE_FLAT => 100,
-            InsuranceCalculator::TYPE_CASCO => 200,
+            InsuranceCalculator::TYPE_CASCO => 199,
             default => 0,
         };
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.5f71b3e1577bf505a71567fee60e4bae.infection.xml

.F

Time: 00:00.004, Memory: 18.00 MB

[Killed] IncrementInteger
OfferClient.php:12:13
         // Dummy response
         return match ($insuranceType) {
             InsuranceCalculator::TYPE_FLAT => 100,
-            InsuranceCalculator::TYPE_CASCO => 200,
+            InsuranceCalculator::TYPE_CASCO => 201,
             default => 0,
         };
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.0fdb7bc4f981ed68bffe67860716bb49.infection.xml

.F

Time: 00:00.003, Memory: 18.00 MB

[Killed] IncrementInteger
OfferClient.php:13:13
         return match ($insuranceType) {
             InsuranceCalculator::TYPE_FLAT => 100,
             InsuranceCalculator::TYPE_CASCO => 200,
-            default => 0,
+            default => 1,
         };
     }
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.8c0a4a3f8137f00e85785535f8d20e94.infection.xml

..F                                                                 3 / 3 (100%)

Time: 00:00.003, Memory: 18.00 MB

[Killed] DecrementInteger
OfferClient.php:13:13
         return match ($insuranceType) {
             InsuranceCalculator::TYPE_FLAT => 100,
             InsuranceCalculator::TYPE_CASCO => 200,
-            default => 0,
+            default => -1,
         };
     }
statusReason: PHPUnit 12.4.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.26
Configuration: /tmp/infection/phpunitConfiguration.b39d09c620e7ae6ce6a115f15fe76233.infection.xml

..F                                                                 3 / 3 (100%)

Time: 00:00.004, Memory: 18.00 MB
